clc; clear; close all;
SWITCH_flag=0;%SWITCH_flag=1-for proposed control approach;SWITCH_flag=0-for control approach proposed in \cite{ding2023auto}
%% 参数设置
CList=slanCL(3,1:22);
alpha1 = 30;
alpha2 = 20;
rho = 10;
Tu = 3;
t0 = 0;
tf = 15;i=1;
for s=5:5:tf
ttf(i)=s;i=i+1;
end
N = 20;

L=[ 4  -1 -1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 -1 -1;
   -1   4 -1 -1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 -1;
   -1  -1  4 -1 -1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0;
    0  -1 -1  4 -1 -1  0  0  0  0  0  0  0  0  0  0  0  0  0  0;
    0   0 -1 -1  4 -1 -1  0  0  0  0  0  0  0  0  0  0  0  0  0;
    0   0  0 -1 -1  4 -1 -1  0  0  0  0  0  0  0  0  0  0  0  0;
    0   0  0  0 -1 -1  4 -1 -1  0  0  0  0  0  0  0  0  0  0  0;
    0   0  0  0  0 -1 -1  4 -1 -1  0  0  0  0  0  0  0  0  0  0;
    0   0  0  0  0  0 -1 -1  4 -1 -1  0  0  0  0  0  0  0  0  0;
    0   0  0  0  0  0  0 -1 -1  4 -1 -1  0  0  0  0  0  0  0  0;
    0   0  0  0  0  0  0  0 -1 -1  4 -1 -1  0  0  0  0  0  0  0;
    0   0  0  0  0  0  0  0  0 -1 -1  4 -1 -1  0  0  0  0  0  0;
    0   0  0  0  0  0  0  0  0  0 -1 -1  4 -1 -1  0  0  0  0  0;
    0   0  0  0  0  0  0  0  0  0  0 -1 -1  4 -1 -1  0  0  0  0;
    0   0  0  0  0  0  0  0  0  0  0  0 -1 -1  4 -1 -1  0  0  0;
    0   0  0  0  0  0  0  0  0  0  0  0  0 -1 -1  4 -1 -1  0  0;
    0   0  0  0  0  0  0  0  0  0  0  0  0  0 -1 -1  4 -1 -1  0;
    0   0  0  0  0  0  0  0  0  0  0  0  0  0  0 -1 -1  4 -1 -1;
   -1   0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 -1 -1  4 -1;
   -1  -1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 -1 -1  4];%

px = [1; 2; 1; -1;-1;2; 4; 2; -2;-2; 3; 6; 3; -3;-3;4; 8; 4; -4;-4];
py = [3^0.5; 0; -3^0.5; -3^0.5;3^0.5;2*3^0.5; 0; 2*-3^0.5; 2*-3^0.5;2*3^0.5;3*3^0.5; 0; 3*-3^0.5; 3*-3^0.5;3*3^0.5;4*3^0.5; 0; 4*-3^0.5; 4*-3^0.5;4*3^0.5];

% 初始状态
x0 = [-10; -5; 5; 10;0;-10; -5; 5; 10;0;-10; -5; 5; 10;0;-10; -5; 5; 10;0];
y0 = [5; -5; -10; -10;-10;5; -5; -10; -10;-10;5; -5; -10; -10;-10;5; -5; -10; -10;-10];
vx0 = zeros(N,1);
vy0 = zeros(N,1);
X0 = [x0; y0; vx0; vy0];

% 领航连接向量 b ∈ {0,1}
b = [1; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0];  % 只有 agent 1 和 agent 3 与领航节点连接

% ODE求解-阶段1
options = odeset('reltol',1e-4,'abstol',1e-4);
[t1, X1] = ode45(@(t, X) dynamics_leader(t, X, L, px, py, b, alpha1, alpha2, rho, Tu, t0), 0:0.01:ttf(1), X0,options);


L=[ 4  -1 -1  0  0  0  0  0  0  0  0  0  0  0  0  0  0 -1 -1;
   -1   3 -1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 -1;
   -1  -1  3 -1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0;
    0   0 -1  3 -1 -1  0  0  0  0  0  0  0  0  0  0  0  0  0;
    0   0  0 -1  3 -1 -1  0  0  0  0  0  0  0  0  0  0  0  0;
    0   0  0 -1 -1  4 -1 -1  0  0  0  0  0  0  0  0  0  0  0;
    0   0  0  0 -1 -1  4 -1 -1  0  0  0  0  0  0  0  0  0  0;
    0   0  0  0  0 -1 -1  4 -1 -1  0  0  0  0  0  0  0  0  0;
    0   0  0  0  0  0 -1 -1  4 -1 -1  0  0  0  0  0  0  0  0;
    0   0  0  0  0  0  0 -1 -1  4 -1 -1  0  0  0  0  0  0  0;
    0   0  0  0  0  0  0  0 -1 -1  4 -1 -1  0  0  0  0  0  0;
    0   0  0  0  0  0  0  0  0 -1 -1  4 -1 -1  0  0  0  0  0;
    0   0  0  0  0  0  0  0  0  0 -1 -1  4 -1 -1  0  0  0  0;
    0   0  0  0  0  0  0  0  0  0  0 -1 -1  4 -1 -1  0  0  0;
    0   0  0  0  0  0  0  0  0  0  0  0 -1 -1  4 -1 -1  0  0;
    0   0  0  0  0  0  0  0  0  0  0  0  0 -1 -1  4 -1 -1  0;
    0   0  0  0  0  0  0  0  0  0  0  0  0  0 -1 -1  4 -1 -1;
   -1   0  0  0  0  0  0  0  0  0  0  0  0  0  0 -1 -1  4 -1;
   -1  -1  0  0  0  0  0  0  0  0  0  0  0  0  0  0 -1 -1  4];%


b = [1; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0];  % 只有 agent 1 和 agent 3 与领航节点连接
t0 = 5;
for k=1:1:ttf(1)/0.01
  xnew1(k,:)=resize_matrix_groups(X1(k,:), 20, 19, 0);
end
xnew1(ttf(1)/0.01+1,:)=resize_matrix_groups(X1(ttf(1)/0.01+1,:), 20, 19, 1);
N=19;
px = [1; 2; 1;-1;2; 4; 2; -2;-2; 3; 6; 3; -3;-3;4; 8; 4; -4;-4];
py = [3^0.5; 0; -3^0.5;3^0.5;2*3^0.5; 0; 2*-3^0.5; 2*-3^0.5;2*3^0.5;3*3^0.5; 0; 3*-3^0.5; 3*-3^0.5;3*3^0.5;4*3^0.5; 0; 4*-3^0.5; 4*-3^0.5;4*3^0.5];
if SWITCH_flag==1
  L1=Isolation(xnew1(ttf(1)/0.01+1,:), px, py,L,N);
else
  L1=L;
end
[t2, X2] = ode45(@(t, X) dynamics_leader(t, X, L1, px, py, b, alpha1, alpha2, rho, Tu, t0),[ttf(1):0.01:ttf(2)],xnew1(ttf(1)/0.01+1,:),options);


% %阶段3
L=[ 4  -1 -1  0  0  0  0  0  0  0  0  0  0  0  0  0  0 -1 -1  0  0;
   -1   3 -1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 -1  0  0;
   -1  -1  3 -1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0;
    0   0 -1  3 -1 -1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0;
    0   0  0 -1  3 -1 -1  0  0  0  0  0  0  0  0  0  0  0  0  0  0;
    0   0  0 -1 -1  4 -1 -1  0  0  0  0  0  0  0  0  0  0  0  0  0;
    0   0  0  0 -1 -1  4 -1 -1  0  0  0  0  0  0  0  0  0  0  0  0;
    0   0  0  0  0 -1 -1  4 -1 -1  0  0  0  0  0  0  0  0  0  0  0;
    0   0  0  0  0  0 -1 -1  4 -1 -1  0  0  0  0  0  0  0  0  0  0;
    0   0  0  0  0  0  0 -1 -1  4 -1 -1  0  0  0  0  0  0  0  0  0;
    0   0  0  0  0  0  0  0 -1 -1  4 -1 -1  0  0  0  0  0  0  0  0;
    0   0  0  0  0  0  0  0  0 -1 -1  4 -1 -1  0  0  0  0  0  0  0;
    0   0  0  0  0  0  0  0  0  0 -1 -1  5 -1 -1  0  0  0  0 -1  0;
    0   0  0  0  0  0  0  0  0  0  0 -1 -1  4 -1 -1  0  0  0  0  0;
    0   0  0  0  0  0  0  0  0  0  0  0 -1 -1  6 -1 -1  0  0 -1 -1;
    0   0  0  0  0  0  0  0  0  0  0  0  0 -1 -1  4 -1 -1  0  0  0;
    0   0  0  0  0  0  0  0  0  0  0  0  0  0 -1 -1  5 -1 -1  0 -1;
   -1   0  0  0  0  0  0  0  0  0  0  0  0  0  0 -1 -1  4 -1  0  0;
   -1  -1  0  0  0  0  0  0  0  0  0  0  0  0  0  0 -1 -1  4  0  0;
    0   0  0  0  0  0  0  0  0  0  0  0 -1  0 -1  0  0  0  0  3 -1;
    0   0  0  0  0  0  0  0  0  0  0  0  0  0 -1  0 -1  0  0 -1  3];%

b = [1; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0];  %
t0 = 10;
for k=1:1:ttf(1)/0.01
  xnew2(k,:)=resize_matrix_groups(X2(k,:), 19, 21, 0);
end
xnew2(ttf(1)/0.01+1,:)=resize_matrix_groups(X2(ttf(1)/0.01+1,:), 19, 21, 1);
N=21;
px = [1; 2; 1;-1;2; 4; 2; -2;-2; 3; 6; 3; -3;-3;4; 8; 4; -4;-4;0;0];
py = [3^0.5; 0; -3^0.5;3^0.5;2*3^0.5; 0; 2*-3^0.5; 2*-3^0.5;2*3^0.5;3*3^0.5; 0; 3*-3^0.5; 3*-3^0.5;3*3^0.5;4*3^0.5; 0; 4*-3^0.5; 4*-3^0.5;4*3^0.5;0;0];
if SWITCH_flag==1
  L3=Isolation(xnew2(ttf(1)/0.01+1,:), px, py,L,N);
else
  L3=L;
end
[t3, X3] = ode45(@(t, X) dynamics_leader(t, X, L3, px, py, b, alpha1, alpha2, rho, Tu, t0),[ttf(2):0.01:ttf(3)],xnew2(ttf(1)/0.01+1,:),options);

%% 
t=zeros(tf/0.01+1,1);
x=zeros(tf/0.01+1,N*12);

t(1:ttf(1)/0.01+1,:)=t1(:,:);
t(ttf(1)/0.01+1:ttf(2)/0.01+1,:)=t2(:,:);
t(ttf(2)/0.01+1:ttf(3)/0.01+1,:)=t3(:,:);

%% 编队误差计算
figure
px = [1; 2; 1; -1;-1;2; 4; 2; -2;-2; 3; 6; 3; -3;-3;4; 8; 4; -4;-4];
py = [3^0.5; 0; -3^0.5; -3^0.5;3^0.5;2*3^0.5; 0; 2*-3^0.5; 2*-3^0.5;2*3^0.5;3*3^0.5; 0; 3*-3^0.5; 3*-3^0.5;3*3^0.5;4*3^0.5; 0; 4*-3^0.5; 4*-3^0.5;4*3^0.5];
for i=1:20
 plot(t1, X1(:,i)-px(i)-2*t1, 'LineWidth', 1.5,'color',CList(i,:));hold on;
end
px = [1; 2; 1;-1;2; 4; 2; -2;-2; 3; 6; 3; -3;-3;4; 8; 4; -4;-4;0;0];
py = [3^0.5; 0; -3^0.5;3^0.5;2*3^0.5; 0; 2*-3^0.5; 2*-3^0.5;2*3^0.5;3*3^0.5; 0; 3*-3^0.5; 3*-3^0.5;3*3^0.5;4*3^0.5; 0; 4*-3^0.5; 4*-3^0.5;4*3^0.5;0;0];
for i=1:3
 plot(t2, X2(:,i)-px(i)-2*t2, 'LineWidth', 1.5,'color',CList(i,:));hold on;
end
for i=4:19
 plot(t2, X2(:,i)-px(i)-2*t2, 'LineWidth', 1.5,'color',CList(i+1,:));hold on;
end
for i=1:3
 plot(t3, X3(:,i)-px(i)-2*t3, 'LineWidth', 1.5,'color',CList(i,:));hold on;
end
for i=4:21
 plot(t3, X3(:,i)-px(i)-2*t3, 'LineWidth', 1.5,'color',CList(i+1,:));hold on;
end
set(gca,'FontSize',12, 'box','on');  
xlabel('Times(s)','FontSize',15); ylabel('$e^x_{pi}$','interpreter','latex','FontSize',16); 
xlim([0 15]);
ylim([-20 15]);
grid on;

axes('position',[.2 .25 .35 .25]);
box on;
px = [1; 2; 1; -1;-1;2; 4; 2; -2;-2; 3; 6; 3; -3;-3;4; 8; 4; -4;-4];
py = [3^0.5; 0; -3^0.5; -3^0.5;3^0.5;2*3^0.5; 0; 2*-3^0.5; 2*-3^0.5;2*3^0.5;3*3^0.5; 0; 3*-3^0.5; 3*-3^0.5;3*3^0.5;4*3^0.5; 0; 4*-3^0.5; 4*-3^0.5;4*3^0.5];
for i=1:20
 plot(t1, X1(:,i)-px(i)-2*t1, 'LineWidth', 1.5,'color',CList(i,:));hold on;
end
px = [1; 2; 1;-1;2; 4; 2; -2;-2; 3; 6; 3; -3;-3;4; 8; 4; -4;-4;0;0];
py = [3^0.5; 0; -3^0.5;3^0.5;2*3^0.5; 0; 2*-3^0.5; 2*-3^0.5;2*3^0.5;3*3^0.5; 0; 3*-3^0.5; 3*-3^0.5;3*3^0.5;4*3^0.5; 0; 4*-3^0.5; 4*-3^0.5;4*3^0.5;0;0];
for i=1:3
 plot(t2, X2(:,i)-px(i)-2*t2, 'LineWidth', 1.5,'color',CList(i,:));hold on;
end
for i=4:19
 plot(t2, X2(:,i)-px(i)-2*t2, 'LineWidth', 1.5,'color',CList(i+1,:));hold on;
end
for i=1:3
 plot(t3, X3(:,i)-px(i)-2*t3, 'LineWidth', 1.5,'color',CList(i,:));hold on;
end
for i=4:21
 plot(t3, X3(:,i)-px(i)-2*t3, 'LineWidth', 1.5,'color',CList(i+1,:));hold on;
end
xlim([1 3.01]);ylim([-0.1 0.1]);
% xlim([1 4]);ylim([-0.01 0.01]);
set(gca,'FontSize',12, 'box','on');  
line([3,3], [-2,20], 'linewidth',1, 'Color','r', 'linestyle','--')
text(3, 0.01, '$\mathcal T_1$', 'interpreter','latex', 'HorizontalAlignment','left','FontSize',12);
axes('position',[.5 .65 .35 .25]);
box on;
px = [1; 2; 1; -1;-1;2; 4; 2; -2;-2; 3; 6; 3; -3;-3;4; 8; 4; -4;-4];
py = [3^0.5; 0; -3^0.5; -3^0.5;3^0.5;2*3^0.5; 0; 2*-3^0.5; 2*-3^0.5;2*3^0.5;3*3^0.5; 0; 3*-3^0.5; 3*-3^0.5;3*3^0.5;4*3^0.5; 0; 4*-3^0.5; 4*-3^0.5;4*3^0.5];
for i=1:20
 plot(t1, X1(:,i)-px(i)-2*t1, 'LineWidth', 1.5,'color',CList(i,:));hold on;
end
px = [1; 2; 1;-1;2; 4; 2; -2;-2; 3; 6; 3; -3;-3;4; 8; 4; -4;-4;0;0];
py = [3^0.5; 0; -3^0.5;3^0.5;2*3^0.5; 0; 2*-3^0.5; 2*-3^0.5;2*3^0.5;3*3^0.5; 0; 3*-3^0.5; 3*-3^0.5;3*3^0.5;4*3^0.5; 0; 4*-3^0.5; 4*-3^0.5;4*3^0.5;0;0];
for i=1:3
 plot(t2, X2(:,i)-px(i)-2*t2, 'LineWidth', 1.5,'color',CList(i,:));hold on;
end
for i=4:19
 plot(t2, X2(:,i)-px(i)-2*t2, 'LineWidth', 1.5,'color',CList(i+1,:));hold on;
end
for i=1:3
 plot(t3, X3(:,i)-px(i)-2*t3, 'LineWidth', 1.5,'color',CList(i,:));hold on;
end
for i=4:21
 plot(t3, X3(:,i)-px(i)-2*t3, 'LineWidth', 1.5,'color',CList(i+1,:));hold on;
end
xlim([5 8.01]);ylim([-0.3 1]);
set(gca,'FontSize',12, 'box','on');  
line([8,8], [-2,20], 'linewidth',1, 'Color','r', 'linestyle','--')
text(8, 0.01, '$\mathcal T_2$', 'interpreter','latex', 'HorizontalAlignment','left','FontSize',12);

%% 系统动态函数
function dX = dynamics_leader(t, X, L, px, py, b, alpha1, alpha2, rho, Tu, t0)
    N = size(L,1);
    x = X(1:N);
    y = X(N+1:2*N);
    vx = X(2*N+1:3*N);
    vy = X(3*N+1:4*N);
    beta=1;%

    % 偏移后误差
    ex = x - px;%
    ey = y - py;%
    disturbance =0.2*cos(t);%zeros(N,1)
    % 领航节点轨迹、速度、加速度
    xl = [2*t; 2*t];
    vl = [2; 2];
    al = [0; 0];

    % eta与phi计算
    epsilon = 1e-8;
    if t < t0 + Tu
        eta = (Tu / (t0 + Tu - t + epsilon))^rho;
%         eta_dot = rho * (Tu / (t0 + Tu - t + epsilon))^rho / (t0 + Tu - t + epsilon);
        eta_dot = rho/ Tu * eta^(1+1/rho);
        phi = eta_dot / eta;
    else
        eta = (Tu)^rho;
        phi = rho / Tu;
    end

    % 控制律
    ux = zeros(N,1); uy = zeros(N,1);
    for i = 1:N
        sum_x = 0; sum_vx = 0;
        sum_y = 0; sum_vy = 0;
        for j = 1:N
            if i~=j
            sum_x = sum_x - L(i,j)*(ex(i) - ex(j));
            sum_vx = sum_vx - L(i,j)*(vx(i) - vx(j));
            sum_y = sum_y - L(i,j)*(ey(i) - ey(j));
            sum_vy = sum_vy - L(i,j)*(vy(i) - vy(j));
            end
        end
        ux(i) = al(1) ...
              - alpha1 * phi^2 * (sum_x + b(i)*(x(i) - xl(1)-px(i))) ...
              - alpha2 * phi * (sum_vx + b(i)*(vx(i) - vl(1)))-beta*sign(alpha1*phi* (sum_x + b(i)*(x(i) - xl(1)-px(i)))+alpha2*(sum_vx + b(i)*(vx(i) - vl(1))));%sign(x(i) - xl(1)-px(i))
        uy(i) = al(2) ...
              - alpha1 * phi^2 * (sum_y + b(i)*(y(i) - xl(2)-py(i))) ...
              - alpha2 * phi * (sum_vy + b(i)*(vy(i) - vl(2)))-beta*sign(alpha1*phi* (sum_y + b(i)*(y(i) - xl(2)-py(i)))+alpha2*(sum_vy + b(i)*(vy(i) - vl(2))));%sign(y(i) - xl(2)-py(i))
    end

    % 状态导数
    dx = vx ;
    dy = vy ;
    dvx = ux+ disturbance;%-1*vx-2*x
    dvy = uy+ disturbance;%-1*vy-2*y
    dX = [dx; dy; dvx; dvy];
end

